---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortError
source: html/2d94bd69-e674-b588-5a37-c80c92cbb6a6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.LineTooShortError Property

Line is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId LineTooShortError { get; }
```